app/views/bids/index.html.erb

<h1>Bids Manager</h1>
<% if (admin? && @bids_join.count > 0) || Bid.where(:user_id => current_user.id).exists? %>
---
SELECT  1 AS one FROM "bids" WHERE "bids"."user_id" = $1 LIMIT 1  [["user_id", 2]]
SELECT "bids".* FROM "bids" WHERE "bids"."user_id" = $1  [["user_id", 3]]

        <% @items_join.each do |item| %>
          <% if Bid.where(:user_id => current_user.id, :item_id => item.id).exists? %>
---
SELECT  1 AS one FROM "bids" WHERE "bids"."user_id" = $1 AND "bids"."item_id" = $2 LIMIT 1  [["user_id", 2], ["item_id", 1]]
SELECT "bids".* FROM "bids" WHERE "bids"."user_id" = $1 AND "bids"."item_id" = $2  ORDER BY bid_amount  [["user_id", 2], ["item_id", 1]]

          <% @bids_join.order('id').reverse.each do |bid| %>
            <tr class='<%= top_bid(Item.find(bid.item_id)).user_id==current_user.id && bid==top_bid(Item.find(bid.item_id)) ? 'success' : '' %>'>
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]