app/views/bids/new.html.erb

	  </p>
	  <% if @bid.item.bids.count > 0 %>
---
SELECT  "bids".* FROM "bids" WHERE "bids"."item_id" = $1  ORDER BY "bids"."id" ASC LIMIT 1  [["item_id", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 2]]
SELECT COUNT(*) FROM "bids" WHERE "bids"."item_id" = $1  [["item_id", 2]]