app/views/auctions/_listing.html.erb

      </tr>
      <% if auction.items.present? %>
---
SELECT "items".* FROM "items" WHERE "items"."auction_id" = $1  [["auction_id", 1]]