app/views/shared/_navbar.html.erb

SELECT "auctions".* FROM "auctions" WHERE "auctions"."active" = $1  [["active", "t"]]
SELECT COUNT(*) FROM "auctions" WHERE "auctions"."active" = $1  [["active", "t"]]
SELECT "auctions".* FROM "auctions"
---
          <ul class="dropdown-menu">
            <% if Auction.where(active: true).count > 0 %>
              <% Auction.all.each do |auction| %>