app/views/items/index.html.erb

SELECT "bids".* FROM "bids" WHERE "bids"."item_id" = $1  ORDER BY bid_amount  [["item_id", 1]]
---
        <td><%= number_to_currency(item.item_value, :unit => "$") %></td>
        <td><% if item.bids.present? %>