app/views/items/show.html.erb

SELECT "bids".* FROM "bids" WHERE "bids"."item_id" = $1  ORDER BY bid_amount  [["item_id", 1]]
---
	  <p>
	    <% if @item.bids.present? %>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
	  	  	  <td>
	  	  	  	<% if User.find(bid.user_id) == current_user %>