app/controllers/admin_panel_controller.rb

  def index
  	@auctions = Auction.all
---
SELECT "auctions".* FROM "auctions"  ORDER BY event_date