app/controllers/auctions_controller.rb

  def index
    @auctions = Auction.all
---
SELECT "auctions".* FROM "auctions"  ORDER BY event_date

  def create
    @auction = Auction.new(auction_params)
    respond_to do |format|
      if @auction.save
---
INSERT INTO "auctions" ("event_date", "start_date", "end_date", "active") VALUES ($1, $2, $3, $4) RETURNING "id"  [["event_date", "2015-10-25"], ["start_date", "2015-10-19 00:00:00.000000"], ["end_date", "2015-10-24 00:00:00.000000"], ["active", "t"]]

  def update
    respond_to do |format|
      if @auction.update(auction_params)
---
UPDATE "auctions" SET "start_date" = $1, "end_date" = $2 WHERE "auctions"."id" = $3  [["start_date", "2015-10-16 06:00:00.000000"], ["end_date", "2015-10-23 13:00:00.000000"], ["id", 1]]

    def set_auction
      @auction = Auction.find(params[:id])
---
SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT 1  [["id", 1]]