app/controllers/bids_controller.rb

SELECT "items".* FROM "items" INNER JOIN "auctions" ON "auctions"."id" = "items"."auction_id" WHERE "auctions"."active" = $1  [["active", "t"]]
SELECT "bids".* FROM "bids" INNER JOIN "items" ON "items"."id" = "bids"."item_id" INNER JOIN "auctions" ON "auctions"."id" = "items"."auction_id" WHERE "auctions"."active" = 't'  ORDER BY bid.created_at
---
  def index
    @items_join = Item.joins(:auction).where(auctions: {active: true})
    @bids_join = Bid.joins(item: :auction).where(auctions: {active: true})

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 1]]
---
  def new
    item = Item.find(params[:item_id])

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "bids".* FROM "bids" WHERE "bids"."item_id" = $1 AND "bids"."bid_amount" = $2  ORDER BY "bids"."id" ASC LIMIT 1  [["item_id", 2], ["bid_amount", "25.0"]]
INSERT INTO "bids" ("bid_amount", "item_id", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["bid_amount", "52.0"], ["item_id", 1], ["user_id", 3]]
UPDATE "bids" SET "user_id" = $1 WHERE "bids"."id" = $2  [["user_id", 2], ["id", 1]]
UPDATE "items" SET "min_bid" = $1 WHERE "items"."id" = $2  [["min_bid", "27.0"], ["id", 1]]
---
  def create
    item = Item.find(params[:item_id])
    if item.bids.present? && User.find(Bid.where(:item_id => item.id).order('bid_amount').reverse.first.user_id).notify_by_email
      outbid_user = User.find(Bid.where(:item_id => item.id).order('bid_amount').reverse.first.user_id)
    else
      outbid_user = nil
    end
    @bid = item.bids.create(bid_params)
    @bid.set_user!(current_user.id)
    respond_to do |format|
      if @bid.save

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "bids" WHERE "bids"."id" = $1  [["id", 1]]
SELECT COUNT(*) FROM "bids" WHERE "bids"."item_id" = $1  [["item_id", 3]]
UPDATE "items" SET "min_bid" = $1 WHERE "items"."id" = $2  [["min_bid", "1.0"], ["id", 3]]
SELECT "bids".* FROM "bids" WHERE "bids"."item_id" = $1  ORDER BY bid_amount  [["item_id", 1]]
---
  def destroy
    item = Item.find(@bid.item_id)
    @bid.destroy
    respond_to do |format|
      if item.bids.count==0
        item.update(:min_bid => item.starting_bid)
      else
        new_min_bid = Bid.where(:item_id => item.id).order('bid_amount').reverse.first.bid_amount

SELECT  "bids".* FROM "bids" WHERE "bids"."id" = $1 LIMIT 1  [["id", 28]]
---
    def set_bid
      @bid = Bid.find(params[:id])