app/controllers/email_templates_controller.rb

  def index
    @email_templates = EmailTemplate.all
---
SELECT "email_templates".* FROM "email_templates"