app/controllers/items_controller.rb

SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT 1  [["id", 1]]
---
  def index
    auction = Auction.find(params[:auction_id])

SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT 1  [["id", 1]]
---
  def new
    auction = Auction.find(params[:auction_id])

SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "items" ("item_title", "item_description", "item_value", "donor_name", "donor_visible", "starting_bid", "min_bid", "min_increase", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "auction_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create
    auction = Auction.find(params[:auction_id])
    @item = auction.items.create(item_params)

UPDATE "items" SET "image_file_name" = $1, "image_content_type" = $2, "image_file_size" = $3, "image_updated_at" = $4 WHERE "items"."id" = $5  [["image_file_name", "Photo_Apr_21__17_21_54.jpg"], ["image_content_type", "image/jpeg"], ["image_file_size", 13509], ["image_updated_at", "2015-10-21 08:50:46.200401"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @item.update(item_params)