app/controllers/users_controller.rb

SELECT "users".* FROM "users"  ORDER BY id
---
  def index
    @users = User.all

INSERT INTO "users" ("first_name", "last_name", "password_digest", "email") VALUES ($1, $2, $3, $4) RETURNING "id"  [["first_name", "Derpette"], ["last_name", "LeTest"], ["password_digest", "$2a$10$jqRAHq1cb9JqLPsdZ1w5YuDeUNg9JiHO4ustR1k1ggK.KJ6Q0t8Cu"], ["email", "derpette@derp.com"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "notify_by_text" = $1, "notify_by_email" = $2, "name_visible" = $3, "phone_number" = $4 WHERE "users"."id" = $5  [["notify_by_text", "t"], ["notify_by_email", "t"], ["name_visible", "t"], ["phone_number", "6027388404"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)